const handler = async (m, {conn, usedPrefix, text, command}) => {
  let hash = text;
  if (m.quoted && m.quoted.fileSha256) hash = m.quoted.fileSha256.toString('hex');
  if (!hash) throw `*[❗𝐈𝐍𝐅𝐎❗] 𝚂𝙾𝙻𝙾 𝚂𝙴 𝙿𝚄𝙴𝙳𝙴𝙽 𝙰𝚂𝙸𝙶𝙽𝙰𝚁 𝚃𝙴𝚇𝚃𝙾𝚂 𝙾 𝙲𝙾𝙼𝙰𝙽𝙳𝙾𝚂 𝙰𝚂𝙸𝙶𝙽𝙰𝙳𝙾𝚂 𝙰 𝚂𝚃𝙸𝙲𝙺𝙴𝚁𝚂 𝙾 𝙸𝙼𝙰𝙶𝙴𝙽𝙴𝚂, 𝙿𝙰𝚁𝙰 𝙾𝙱𝚃𝙴𝙽𝙴𝚁 𝙴𝙻 𝙲𝙾𝙳𝙸𝙶𝙾 𝙰𝚂𝙸𝙶𝙽𝙰𝙳𝙾 𝚄𝚂𝙴 𝙴𝙻 𝙲𝙾𝙼𝙰𝙽𝙳𝙾 ${usedPrefix}listcmd*`;
  const sticker = global.db.data.sticker;
  if (sticker[hash] && sticker[hash].locked) throw '*[❗𝐈𝐍𝐅𝐎❗] 𝙤𝙣𝙡𝙮 𝙩𝙝𝙚 𝙤𝙬𝙣𝙚𝙧 𝙘𝙖𝙣 𝙥𝙚𝙧𝙛𝙤𝙧𝙢 𝙩𝙝𝙚 𝙙𝙚𝙡𝙚𝙩𝙞𝙤𝙣*';
  delete sticker[hash];
  m.reply(`*[ ✔ ] 𝙩𝙝𝙚 𝙩𝙚𝙭𝙩/𝙘𝙤𝙢𝙢𝙖𝙣𝙙 𝙖𝙨𝙨𝙞𝙜𝙣𝙚𝙙 𝙩𝙤 𝙩𝙝𝙚 𝙨𝙩𝙞𝙘𝙠𝙚𝙧/𝙞𝙢𝙖𝙜𝙚 𝙬𝙖𝙨 𝙧𝙚𝙢𝙤𝙫𝙚𝙙 𝙛𝙧𝙤𝙢 𝙩𝙝𝙚 𝙙𝙖𝙩𝙖𝙗𝙖𝙨𝙚 𝙘𝙤𝙧𝙧𝙚𝙘𝙩𝙡𝙮*`);
};
handler.command = ['delcmd'];
handler.rowner = true;
export default handler;